src/rpc/psdims.get-all-data.res.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
  xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xop="http://www.w3.org/2004/08/xop/include"
  xmlns:xmime5="http://www.w3.org/2005/05/xmlmime"
  xmlns:psdims="urn:psdims">
 <SOAP-ENV:Body>
  <psdims:client-data>
   <chats>
    <chat-info>
     <chat-id>0</chat-id>
     <description></description>
     <admin></admin>
     <read-timestamp>0</read-timestamp>
     <all-read-timestamp>0</all-read-timestamp>
     <members>
      <name>
       <string></string>
      </name>
      <name>
       <string></string>
      </name>
      <last-timestamp>0</last-timestamp>
     </members>
    </chat-info>
    <chat-info>
     <chat-id>0</chat-id>
     <description></description>
     <admin></admin>
     <read-timestamp>0</read-timestamp>
     <all-read-timestamp>0</all-read-timestamp>
     <members>
      <name>
       <string></string>
      </name>
      <name>
       <string></string>
      </name>
      <last-timestamp>0</last-timestamp>
     </members>
    </chat-info>
    <last-timestamp>0</last-timestamp>
   </chats>
   <friends>
    <user>
     <name></name>
     <information></information>
    </user>
    <user>
     <name></name>
     <information></information>
    </user>
    <last-timestamp>0</last-timestamp>
   </friends>
   <friend-requests>
    <user>
     <name>
      <string></string>
     </name>
     <send-date>0</send-date>
    </user>
    <user>
     <name>
      <string></string>
     </name>
     <send-date>0</send-date>
    </user>
   </friend-requests>
   <timestamp>0</timestamp>
  </psdims:client-data>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
